IDENTIFICATION DIVISION.
PROGRAM-ID. FIZZBUZZ.
DATA DIVISION.
WORKING-STORAGE SECTION.

01 COUNTER PIC 999.
01 PRINT-STORAGE.
    05 REM-3 PIC 9.
    05 REM-5 PIC 9.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    PERFORM PRINT-PROCEDURE
        VARYING COUNTER FROM 1 BY 1 until COUNTER = 100.
    STOP RUN.
PRINT-PROCEDURE.
    COMPUTE REM-3 = FUNCTION MOD (COUNTER, 3).
    COMPUTE REM-5 = FUNCTION MOD (COUNTER, 5).
    IF REM-3 = 0 AND REM-5 = 0 THEN
        DISPLAY "FIZZBUZZ".

   IF REM-3 = 0 AND NOT REM-5 = 0 THEN
        DISPLAY "FIZZ".

    IF REM-5 = 0 AND NOT REM-3 = 0 THEN
        DISPLAY "BUZZ".

    IF REM-3 NOT EQUALS 0 AND REM-5 NOT EQUALS 0 THEN
        DISPLAY COUNTER.
END PROGRAM FIZZBUZZ.
